numbers = [1, 5, 6, 12, 3, 10, 7, 4]
count = 0

# Цикл для перебора элементов списка
for num in numbers:
    # Проверка на четность: остаток от деления на 2 равен 0
    if num % 2 == 0:
        count += 1

print(f"Количество четных чисел: {count}")
#Через цикл while
numbers = [1, 5, 8, 12, 15, 19, 4, 10]
i = 0      # Инициализация индекса

# Цикл while перебирает элементы по индексу
while i < len(numbers):
    if numbers[i] % 2 == 0:  # Проверка на четность
       
    i += 1  # Увеличение индекса

print(f"Количество четных чисел: {i}")
